Test Start : Test.vbs

Section> T_TestSet - Test_current
<Section tree="T_TestSet - Test_current">
</Section>

Section> T_TestSet - Test_build
<Section tree="T_TestSet - Test_build">
==========================================================
((( [T_TestSet\Test.vbs] - Test_build )))
Pass.
</Section>

Section> T_TestSet - Test_setup
<Section tree="T_TestSet - Test_setup">
==========================================================
((( [T_TestSet\Test.vbs] - Test_setup )))
Pass.
</Section>

Section> T_TestSet - Test_start
<Section tree="T_TestSet - Test_start">
==========================================================
((( [T_TestSet\Test.vbs] - Test_start )))
>current dir = "C:\home\mem_cache\MyDoc\src\vbslib new\_src\TestByFCBatAuto\TestPrompt\T_TestSet"
>RunProg  cscript Test_5_do_test.vbs
Microsoft (R) Windows Script Host Version 5.8
Copyright (C) Microsoft Corporation 1996-2001. All rights reserved.

<<< [T_TestSet] >>>
C:\home\mem_cache\MyDoc\src\vbslib new\_src\TestByFCBatAuto\TestPrompt\T_TestSet>cscript //nologo Test_target.vbs /set_input:.1..2.9.
>SetWritableMode  F_ErrIfWarn
--------------------------------------------------------
Test Prompt [ALL]
   test vbs = T_TestSet_2\Test_target.vbs
   base folder = C:\home\mem_cache\MyDoc\src\vbslib new\_src\TestByFCBatAuto\TestPrompt\T_TestSet
1. Select the Test (current test = ALL)
2. Do ALL Test
3. | call each "Test_build" in sub folders
4. | call each "Test_setup" in sub folders
5. | call each "Test_start" in sub folders
6. | call each "Test_check" in sub folders
7. | call each "Test_clean" in sub folders
8. Change the Debug Mode (debug script=False, target=False)
88.Open Fail Folder
89.Next Fail
9. Quit
Select number>
--------------------------------------------------------
--------------------------------------------------------
Test Prompt [ALL]
   test vbs = T_TestSet_2\Test_target.vbs
   base folder = C:\home\mem_cache\MyDoc\src\vbslib new\_src\TestByFCBatAuto\TestPrompt\T_TestSet
1. Select the Test (current test = ALL)
2. Do ALL Test
3. | call each "Test_build" in sub folders
4. | call each "Test_setup" in sub folders
5. | call each "Test_start" in sub folders
6. | call each "Test_check" in sub folders
7. | call each "Test_clean" in sub folders
8. Change the Debug Mode (debug script=False, target=False)
88.Open Fail Folder
89.Next Fail
9. Quit
Select number>1
--------------------------------------------------------
Test symbol list:
  0) ALL (tests marked '+' by TestCommon_Data.xml#/TestCases/@TestSymbols)
+ 1) T_TestSet
  2) T_TestSet_1
+ 3) T_TestSet_2
Input test number or symbol or "ALL">
--------------------------------------------------------
Test Prompt [ALL]
   base folder = C:\home\mem_cache\MyDoc\src\vbslib new\_src\TestByFCBatAuto\TestPrompt\T_TestSet
1. Select the Test (current test = ALL)
2. Do ALL Test
3. | call each "Test_build" in sub folders
4. | call each "Test_setup" in sub folders
5. | call each "Test_start" in sub folders
6. | call each "Test_check" in sub folders
7. | call each "Test_clean" in sub folders
8. Change the Debug Mode (debug script=False, target=False)
88.Open Fail Folder
89.Next Fail
9. Quit
Select number>2
--------------------------------------------------------
Test Start : Test_target.vbs

Section> T_TestSet_2 - Test_current
<Section tree="T_TestSet_2 - Test_current">
</Section>

Section> T_TestSet - Test_current
<Section tree="T_TestSet - Test_current">
</Section>

Section> T_TestSet_2 - Test_build
<Section tree="T_TestSet_2 - Test_build">
==========================================================
((( [T_TestSet\Test_target.vbs] - Test_build )))
Test_build
Pass.
</Section>

Section> T_TestSet - Test_build
<Section tree="T_TestSet - Test_build">
==========================================================
((( [T_TestSet_2\Test_target.vbs] - Test_build )))
Test_build
Pass.
</Section>

Section> T_TestSet_2 - Test_setup
<Section tree="T_TestSet_2 - Test_setup">
==========================================================
((( [T_TestSet\Test_target.vbs] - Test_setup )))
Test_setup
Pass.
</Section>

Section> T_TestSet - Test_setup
<Section tree="T_TestSet - Test_setup">
==========================================================
((( [T_TestSet_2\Test_target.vbs] - Test_setup )))
Test_setup
Pass.
</Section>

Section> T_TestSet_2 - Test_start
<Section tree="T_TestSet_2 - Test_start">
==========================================================
((( [T_TestSet\Test_target.vbs] - Test_start )))
Test_start
Pass.
</Section>

Section> T_TestSet - Test_start
<Section tree="T_TestSet - Test_start">
==========================================================
((( [T_TestSet_2\Test_target.vbs] - Test_start )))
Test_start
Pass.
</Section>

Section> T_TestSet_2 - Test_check
<Section tree="T_TestSet_2 - Test_check">
==========================================================
((( [T_TestSet_2\Test_target.vbs] - Test_check )))
Test_check
Pass.
</Section>

Section> T_TestSet_2 - Test_check
<Section tree="T_TestSet_2 - Test_check">
==========================================================
((( [T_TestSet\Test_target.vbs] - Test_check )))
Test_check
Pass.
</Section>

Section> T_TestSet - Test_clean
<Section tree="T_TestSet - Test_clean">
==========================================================
((( [T_TestSet_2\Test_target.vbs] - Test_clean )))
Test_clean
Pass.
</Section>

Section> T_TestSet_2 - Test_clean
<Section tree="T_TestSet_2 - Test_clean">
==========================================================
((( [T_TestSet\Test_target.vbs] - Test_clean )))
Test_clean
Pass.
</Section>
==========================================================
Test Finish (Pass=10, Manual=0, Skip=0, Fail=0)

--------------------------------------------------------
Test Prompt [ALL]
   base folder = C:\home\mem_cache\MyDoc\src\vbslib new\_src\TestByFCBatAuto\TestPrompt\T_TestSet
1. Select the Test (current test = ALL)
2. Do ALL Test
3. | call each "Test_build" in sub folders
4. | call each "Test_setup" in sub folders
5. | call each "Test_start" in sub folders
6. | call each "Test_check" in sub folders
7. | call each "Test_clean" in sub folders
8. Change the Debug Mode (debug script=False, target=False)
88.Open Fail Folder
89.Next Fail
9. Quit
Select number>9
--------------------------------------------------------

>fc  "Test_logs.txt", "T_TestSet_ans.txt"
Pass.

Pass.
</Section>

Section> T_TestSet - Test_check
<Section tree="T_TestSet - Test_check">
==========================================================
((( [T_TestSet\Test.vbs] - Test_check )))
Pass.
</Section>

Section> T_TestSet - Test_clean
<Section tree="T_TestSet - Test_clean">
==========================================================
((( [T_TestSet\Test.vbs] - Test_clean )))
>current dir = "C:\home\mem_cache\MyDoc\src\vbslib new\_src\TestByFCBatAuto\TestPrompt\T_TestSet"
>RunProg  cscript Test_7_clean.vbs
Microsoft (R) Windows Script Host Version 5.8
Copyright (C) Microsoft Corporation 1996-2001. All rights reserved.

>del  "*_log.txt"
Done.

Pass.
</Section>
==========================================================
Test Finish (Pass=5, Manual=0, Skip=0, Fail=0)

