Test Start : T_SomeTests.vbs

Section> T_SampB - Test_current
<Section tree="T_SampB - Test_current">
</Section>

Section> T_SomeTests - Test_current
<Section tree="T_SomeTests - Test_current">
</Section>

Section> T_SampA - Test_build
<Section tree="T_SampA - Test_build">
==========================================================
((( [T_SomeTests\TestOfTest1.vbs] - Test_build )))
Pass.
</Section>

Section> T_SomeTests - Test_build
<Section tree="T_SomeTests - Test_build">
==========================================================
((( [T_SampA\TestOfTest1.vbs] - Test_build )))
Pass.
</Section>

Section> T_SampA - Test_setup
<Section tree="T_SampA - Test_setup">
==========================================================
((( [T_SomeTests\TestOfTest1.vbs] - Test_setup )))
Pass.
</Section>

Section> T_SomeTests - Test_setup
<Section tree="T_SomeTests - Test_setup">
==========================================================
((( [T_SampA\TestOfTest1.vbs] - Test_setup )))
Pass.
</Section>

Section> T_SampA - Test_start
<Section tree="T_SampA - Test_start">
==========================================================
((( [T_SomeTests\TestOfTest1.vbs] - Test_start )))
Pass.
</Section>

Section> T_SomeTests - Test_start
<Section tree="T_SomeTests - Test_start">
==========================================================
((( [T_SampA\TestOfTest1.vbs] - Test_start )))
Pass.
</Section>

Section> T_SampA - Test_check
<Section tree="T_SampA - Test_check">
==========================================================
((( [T_SampA\TestOfTest1.vbs] - Test_check )))
Pass.
</Section>

Section> T_SampA - Test_check
<Section tree="T_SampA - Test_check">
==========================================================
((( [T_SomeTests\TestOfTest1.vbs] - Test_check )))
Pass.
</Section>

Section> T_SomeTests - Test_clean
<Section tree="T_SomeTests - Test_clean">
==========================================================
((( [T_SampA\TestOfTest1.vbs] - Test_clean )))
Pass.
</Section>

Section> T_SampA - Test_clean
<Section tree="T_SampA - Test_clean">
==========================================================
((( [T_SomeTests\TestOfTest1.vbs] - Test_clean )))
Pass.
</Section>
==========================================================
Test Finish (Pass=10, Manual=0, Skip=0, Fail=0)

